# USING K Nearest Neighbors (KNN) REGRESSION ON SOCIAL_NETWORK_ADS DATASET TO FIND WHETHER A CUSTOMER WILL BUY THE PRODUCT OR NOT.

In [148]:
# Importing pacakages

import numpy as np

import pandas as pd

In [149]:
data=pd.read_csv("/content/Social_Network_Ads.csv")

In [150]:
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

# DROPPING THE "User ID" COLUMN

In [169]:
df=data.drop(['User ID'],axis=1)

df.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

# PERFORMING ONE HOT ENCODING TO CONVERT CATEGORICAL VARIABLE INTO NUMERICAL VARIABLE

In [170]:
df["Gender"]=df["Gender"].apply({'Male':1,'Female':0}.get)

df.head()

   Gender  Age  EstimatedSalary  Purchased
0       1   19            19000          0
1       1   35            20000          0
2       0   26            43000          0
3       0   27            57000          0
4       1   19            76000          0

# DIVIDING THE DATA INTO DEPENDENT AND INDEPENDENT COLUMNS

In [153]:
x=df.iloc[:,:-1]        # Independent columns

x.head()

   Gender  Age  EstimatedSalary
0       1   19            19000
1       1   35            20000
2       0   26            43000
3       0   27            57000
4       1   19            76000

In [154]:
y=df.iloc[:,-1]   # Dependent Column

y.head(20)

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     1
8     0
9     0
10    0
11    0
12    0
13    0
14    0
15    0
16    1
17    1
18    1
19    1
Name: Purchased, dtype: int64

In [171]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test = train_test_split(x,y, test_size=0.2)

In [172]:
from sklearn.neighbors import KNeighborsClassifier

model=KNeighborsClassifier(n_neighbors=6, metric='euclidean') # Converting metric minkowski to metric euclidean

model.fit(x_train,y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='euclidean',
                     metric_params=None, n_jobs=None, n_neighbors=6, p=2,
                     weights='uniform')

In [173]:
prediction=model.predict(x_test)

prediction

array([1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0])

In [174]:
from sklearn.metrics import confusion_matrix, accuracy_score

cm=confusion_matrix(y_test,prediction)

ac=accuracy_score(y_test,prediction)

print(cm)

[[44  2]
 [16 18]]

In [175]:
print("The accuracy of the model is ", ac)

The accuracy of the model is  0.775

# PREDICTING WHETHER THE CUSTOMER WILL BUY THE PRODUCT OR NOT FOR A NEW CUSTOMER.

In [164]:
df.head()

   Gender  Age  EstimatedSalary  Purchased
0       1   19            19000          0
1       1   35            20000          0
2       0   26            43000          0
3       0   27            57000          0
4       1   19            76000          0

In [165]:
data_new={'Gender':0,'Age':28,'EstimatedSalary':100000}

index=[1]

In [166]:
new_customer=pd.DataFrame(data_new,index)

new_customer

   Gender  Age  EstimatedSalary
1       0   28           100000

In [176]:
prediction_new=model.predict(new_customer)

print("The prediction for the new customer is ", prediction_new)

The prediction for the new customer is  [1]

# SO FOR A NEW CUSTOMER WHOSE GENDER IS FEMALE, AGE IS 28 YRS AND ESTIMATED SALARY IS 100000 THE PREDICTION OUTPUT IS [1], SINCE [O] MEANS NOT BUY AND [1] MEANS BUY THE PRODUCT, THE NEW CUSTOMER WILL BUY THE PRODUCT.